In [2]:
import pandas as pd
import numpy as np
from pandas import DataFrame

#级联的应用concat,concat 只拼接列明相同的项目，不同的会自动分列表示，缺失用nan自动填充

In [40]:
df1=DataFrame({'employee':['bob','linda','bill'],
              'group':['accounting','product','market'],
              'hire_date':[1998,2017,2018]})
df1

  employee       group  hire_date
0      bob  accounting       1998
1    linda     product       2017
2     bill      market       2018

In [6]:
pd.concat((df1,df1),axis=0)#axis=0方向是垂直，

  employee       group  hire_date
0      bob  accounting       1998
1    linda     product       2017
2     bill      market       2018
0      bob  accounting       1998
1    linda     product       2017
2     bill      market       2018

In [8]:
pd.concat((df1,df1),axis=1)#axis=1是横向级联，横向拼接

  employee       group  hire_date employee       group  hire_date
0      bob  accounting       1998      bob  accounting       1998
1    linda     product       2017    linda     product       2017
2     bill      market       2018     bill      market       2018

In [32]:
df2=df1
df2.columns=['employee','groupps','hire_date']
df2

  employee     groupps  hire_date
0      bob  accounting       1998
1    linda     product       2017
2     bill      market       2018

In [28]:
pd.concat((df1,df2),axis=0)#因为直接直接用df1=df2

  employee     groupps  hire_date
0      bob  accounting       1998
1    linda     product       2017
2     bill      market       2018
0      bob  accounting       1998
1    linda     product       2017
2     bill      market       2018

In [41]:
#换一下
df2=df1.copy()
df2.columns=['employee','groupps','hire_date']
df2

  employee     groupps  hire_date
0      bob  accounting       1998
1    linda     product       2017
2     bill      market       2018

In [42]:
df1

  employee       group  hire_date
0      bob  accounting       1998
1    linda     product       2017
2     bill      market       2018

In [43]:
pd.concat((df1,df2),axis=0)

d:\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

  employee       group     groupps  hire_date
0      bob  accounting         NaN       1998
1    linda     product         NaN       2017
2     bill      market         NaN       2018
0      bob         NaN  accounting       1998
1    linda         NaN     product       2017
2     bill         NaN      market       2018

#outer 可以级联所有项目 inner只会级联已知项目

In [44]:
pd.concat((df1,df2),axis=0,join='inner')

  employee  hire_date
0      bob       1998
1    linda       2017
2     bill       2018
0      bob       1998
1    linda       2017
2     bill       2018

append只能用列级联拼接.没有axis选项

df合并的应用merge

In [57]:
df1=DataFrame({'employee':['bob','jake','lisa'],
              'group':['accounting','product','market']})
df1

  employee       group
0      bob  accounting
1     jake     product
2     lisa      market

In [58]:
df2=DataFrame({'employee':['lisa','bob','jake'],'hire_date':[2004,2008,2009]})
df2

  employee  hire_date
0     lisa       2004
1      bob       2008
2     jake       2009

In [59]:
pd.merge(df1,df2,on="employee")#一般会默认公共列合并

  employee       group  hire_date
0      bob  accounting       2008
1     jake     product       2009
2     lisa      market       2004

In [60]:
df3=DataFrame({'employee':['lisa','jake'],
              'group':['accounting','engneering'],
              'hire_date':[2004,2006]})
df3

  employee       group  hire_date
0     lisa  accounting       2004
1     jake  engneering       2006

#多对多合并

In [71]:
df1=DataFrame({'employee':['bob','jake','lisa'],
              'group':['accounting','product','market']})
df1

  employee       group
0      bob  accounting
1     jake     product
2     lisa      market

In [67]:
df4=DataFrame({'group':['engneering','engneering','HR'],
               'supervisor' : ['caley','guido','steven']})
df4

        group supervisor
0  engneering      caley
1  engneering      guido
2          HR     steven

In [74]:
pd.merge(df1,df4,how="outer")

  employee       group supervisor
0      bob  accounting        NaN
1     jake     product        NaN
2     lisa      market        NaN
3      NaN  engneering      caley
4      NaN  engneering      guido
5      NaN          HR     steven

#左合并，右合并的应用，columns不一样的情况的如何处理问题、

行列都一样就用级联concat，行列不一样可以用merge合并，设定左右联结的共同区域

In [75]:
df1=DataFrame({'employee':['bob','linda','bill'],
              'group':['accounting','product','market'],
              'hire_date':[1998,2017,2018]})
df1

  employee       group  hire_date
0      bob  accounting       1998
1    linda     product       2017
2     bill      market       2018

In [76]:
df5=DataFrame({'name':['lisa','bob','bill'],
               'hire_date' : ['1998','2016','2007']})
df5

   name hire_date
0  lisa      1998
1   bob      2016
2  bill      2007

In [80]:
pd.merge(df1,df5,left_on="employee",right_on="name",how='left')#类似于左连接，只保留左表的数据，或者以左表为准

  employee       group  hire_date_x  name hire_date_y
0      bob  accounting         1998   bob        2016
1    linda     product         2017   NaN         NaN
2     bill      market         2018  bill        2007